Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/irish_social_welfare_system/social_assistance_payments/index.html.txt.tmx
Source language: en
Languages: ga

source: Social assistance in Ireland
ga: Cúnamh sóisialach in Éirinn

source: To get a social assistance payment you must be habitually resident and pass a means test
ga: Ní mór duit gnáthchónaí a bheith ort in Éirinn agus ní mór duit tástáil acmhainne a shásamh le cáiliú d' íocaíocht chúnaimh shóisialaigh

source: This document lists the different social assistance payments from the Department of Social Protection
ga: Liostaíonn an doiciméad seo na híocaíochtaí cúnaimh shóisialaigh a íocann Roinn Coimirce Sóisialaí

source: Residence requirements for social assistance in Ireland
ga: Díotha cónaithe do chabhair shóisialta in Éirinn

source: You must be habitually resident in Ireland to qualify for social assistance payments
ga: Ón 1 Bealtaine 2004, ní mór duit gnáthchónaí a bheith ort in Éirinn le bheith cáilithe d'íocaíochtaí cúnaimh shóisialaigh

source: What is the habitual residence rule and how do you satisfy it?
ga: Céard é an riail a bhaineann le gnáthchónaí agus cén chaoi a sásaíonn duine é?

source: Most Read in "Social Welfare"
ga: Ábhar is mó éilimh i "Leas Sóisialach"

source: Back to School Clothing and Footwear Allowance
ga: Liúntas Éadaí agus Coisbhirt chun Filleadh ar Scoil
